package com.secondWind.modooDiary.common.filter.badword;

import lombok.Data;
import lombok.NoArgsConstructor;

public class BadWords {
    public String[] badWords = {
            "18아", "18놈", "18새끼", "18뇬", "18노", "18것", "18넘",
            "개년", "개놈", "개뇬", "개새", "개색끼", "개세끼", "개세이",
            "개쉐이", "개쉑", "개쉽", "개시키", "개자식", "개좆", "게색기",
            "게색끼", "광뇬", "뇬", "눈깔", "뉘미럴", "니귀미", "니기미",
            "병쉰", "병신", "뻐큐", "뻑큐", "뽁큐", "삐리넷", "새꺄", "쉬발",
            "쉬밸", "쉬팔", "쉽알", "스패킹", "스팽", "시벌", "시부랄", "시부럴",
            "시부리", "시불", "시브랄", "시팍", "시팔", "시펄", "실밸", "십8", "시잇팔",
            "십쌔", "십창", "싶알", "쌉년", "썅놈", "쌔끼", "쌩쑈", "썅", "써벌",
            "썩을년", "쎄꺄", "쎄엑", "쓰바", "쓰발", "쓰벌", "쓰팔", "씨8", "씨댕",
            "씨바", "씨발", "씨뱅", "씨봉알", "씨부랄", "씨부럴", "씨부렁", "씨부리",
            "씨불", "씨브랄", "씨빠", "씨빨", "씨뽀랄", "씨팍", "씨팔", "씨펄", "씹",
            "엄창", "접년", "잡놈", "재랄", "조까", "조빠", "좀물", "좁년", "좃", "좆",
            "좇", "쥐랄","쥐롤","쥬디","지랄","지럴","지롤","지미랄","쫍빱","凸","퍽큐","뻑큐","빠큐", "ㅅㅂㄹㅁ"
    };
}
